# #+SETUPFILE: org-html-themes/setup/theme-readtheorg-local.setup
#+SETUPFILE: org-bootstrap-document/setup.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:4 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:t f:t inline:t num:3 p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: Matematika skozi Python
#+DATE: <2017-01-26 čet>
#+AUTHOR: Martin Vuk
#+EMAIL: martin.vuk@fri.uni-lj.si
#+LANGUAGE: sl
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.1.1 (Org mode 9.0.3)
#+PROPERTY: header-args  :results output 
**** Rešitev 
     :PROPERTIES:
     :HTML_CONTAINER_CLASS: resitev
     :END:
    #+BEGIN_SRC python
      for n in range(15):
          print((n-1)/(n+1))
    #+END_SRC

    #+RESULTS:
    #+begin_example
    -1.0
    0.0
    0.3333333333333333
    0.5
    0.6
    0.6666666666666666
    0.7142857142857143
    0.75
    0.7777777777777778
    0.8
    0.8181818181818182
    0.8333333333333334
    0.8461538461538461
    0.8571428571428571
    0.8666666666666667
#+end_example

**** Rešitev
     :PROPERTIES:
     :HTML_CONTAINER_CLASS: resitev
     :END:
#+BEGIN_SRC python :results output
  an = 2
  print(an)
  for i in range(9):
      an = (2*an**3+2)/(3*an**2)
      print(an)
#+END_SRC

#+RESULTS:
#+begin_example
2
1.5
1.2962962962962963
1.2609322247417485
1.2599218605659261
1.2599210498953948
1.259921049894873
1.2599210498948732
1.259921049894873
1.2599210498948732
#+end_example

Členi zaporedja se po 5. členu začnejo ponavljati. Zaporedje je očitno
*konvergentno*. Zadnjih nekaj členov so zelo dobri približki za *limito*.
**** Rešitev z generatorjem
     :PROPERTIES:
     :HTML_CONTAINER_CLASS: resitev
     :END:
Za ilustracijo nalogo rešimo še z *generatorjem*. Generator je funkcija, ki je
posebne vrste tip *iteratorja*. *Iterator* je objekt, ki pozna metodo ~next()~
in ga lahko uporabimo v ~for~ zanki. Funkcijo spremenimo v *generator* z uporabo
ukaza ~yield~, ki je zelo podoben ukazu ~return~, le da se ob njegovem klicu
izvajanje funkcije zamrzne do naslednjega klica metode ~next()~. Z generatorjem
na ta način lahko definiramo tudi neskončna zaporedja oziroma zaporedja
poljubnih dolžin. 

#+BEGIN_SRC python :results output
  def zaporedje(n):
      "Generator za prvih n členov zaporedja an"
      an = 2
      while n>0:
          yield an
          an = (2*an**3+2)/(3*an**2)
          n -= 1

  for clen in zaporedje(10):
      print(clen)
#+END_SRC

#+RESULTS:
#+begin_example
2
1.5
1.2962962962962963
1.2609322247417485
1.2599218605659261
1.2599210498953948
1.259921049894873
1.2599210498948732
1.259921049894873
1.2599210498948732
#+end_example
**** Rešitev z rekurzijo
     :PROPERTIES:
     :HTML_CONTAINER_CLASS: resitev
     :END:
Zaporedje $a_n$ lahko definiramo tudi z rekurzivno funkcijo. Paziti moramo le,
da znotraj funkcije opravimo le en klic na isto funkcijo, sicer časovna
zahtevnost eksponentno narašča.
#+BEGIN_SRC python :results output
  def zaporedje(n):
      "Rekurzivna funkcija, ki definira rekurzivno zaporedje"
      if n<=0:
          return 2
      else:
          an = zaporedje(n-1)
          return (2*an**3+2)/(3*an**2) 

  for n in range(10):
      print(zaporedje(n))
#+END_SRC  

#+RESULTS:
#+begin_example
2
1.5
1.2962962962962963
1.2609322247417485
1.2599218605659261
1.2599210498953948
1.259921049894873
1.2599210498948732
1.259921049894873
1.2599210498948732
#+end_example

Kljub temu, da smo se z enim rekurzivnim klicem funkcije izognili eksponentni
časovni odvisnosti, je pri večkratnih klicih funkcije ~zaporedje~ še vedno
precej odvečnih izračunov. Ob vsakem zaporednem klicu funkcije ponovno
izračunamo vse člene od prvega naprej. Časovna zahtevnost ~for~ zanke je tako
kvadratična, medtem ko je pri prejšnjih rešitvah časovna zahtevnost linearna. 
**** Rešitev
     :PROPERTIES:
     :HTML_CONTAINER_CLASS: resitev
     :END:
#+BEGIN_SRC python :results output
  n = 0
  a = -0.5
  eps = 0.01
  while abs((n**2+n-1)/(1-2*n**2)-a)>eps:
      n += 1
  print(n)
#+END_SRC

#+RESULTS:
: 50
**** Rešitev z generatorjem
     :PROPERTIES:
     :HTML_CONTAINER_CLASS: resitev
     :END:
Za ilustracijo nalogo rešimo še z *generatorjem*. Generator je funkcija, ki je
posebne vrste tip *iteratorja*. *Iterator* je objekt, ki pozna metodo ~next()~
in ga lahko uporabimo v ~for~ zanki. Funkcijo spremenimo v *generator* z uporabo
ukaza ~yield~, ki je zelo podoben ukazu ~return~, le da se ob 

#+BEGIN_SRC python :results output
  def zaporedje():
      n = 0
      while True:
          yield n, (n**2+n-1)/(1-2*n**2)
          n += 1
  a = -0.5
  eps = 0.01

  for n, clen in zaporedje():
      if abs(clen-a)<eps:
          print(n)
          break
#+END_SRC

#+RESULTS:
: 50

*** Ničle tabelirane funkcije
Za zvezno funkcija poznamo le nekaj posameznih vrednosti. Podana imamo dva
seznama enake dolžine ~x~ in ~y~, tako da velja ~y[i] == f(x[i])~.

Napišite funkcijo ~nicle(x,y)~, ki izračuna približne vrednosti ničel, tako da
funkcijo nadomesti z /linearnim zlepkom/ in izračuna ničle zlepka. Linearni zlepek
dobimo tako, da graf funkcije $f(x)$
nadomestimo z daljicami (linearno funkcijo $y=kx+n$) med točkami, ki so podane s
seznamoma ~x~ in ~y~.

Funkcija ~nicle(x,y)~ naj vrne seznam približkov za ničle, urejenih po velikosti. Primer:

#+BEGIN_SRC python :noweb strip-export :exports both
<<nicle>>
x = [-1, 0, 1, 2, 3]
y = [1, -1, 1, 2, 3]
print(nicle(x,y))
#+END_SRC

#+RESULTS:
: [-0.5, 0.5]
*** Bisekcija
Če ima zvezna funkcija v krajiščih intervala različna predznaka, potem je na tem
intervalu zagotovo vsaj ena ničla. To dejstvo uporabi metoda bisekcije, s katero
lahko poiščemo ničle. 

Napišite funkcijo ~bisekcija(f, interval, eps)~, ki z bisekcijo poišče interval
dolžine največ eps, na katerem je ničla funkcije $f$. Krajišči začetnega intervala
sta podani v seznamu ~interval~. Funkcija naj vrne seznam s krajišči intervala. Če
vrednosti na intervalu nimajo različnega predznaka, naj funkcija javi napako
tipa ~ValueError~. 

Primer:

#+BEGIN_SRC python :noweb strip-export :exports both
<<bisekcija>>
f = lambda x: x**2-2
print(bisekcija(f, (1,2), 0.3))
#+END_SRC

#+RESULTS:
: [1, 1.5]

#+BEGIN_SRC python :noweb strip-export
  <<bisekcija>>
  try:
    f = lambda x: x**2-2
    bisekcija(f,(2,3),0.3)
  except ValueError as err:
    print(err)
#+END_SRC

#+RESULTS:
: Vrednosti v krajiščih nimajo različnih predznakov

ValueError: Na intervalu ni ničle.

